// Описание
// 
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы - 
// 
// Возвращаемое значение:
//	СправочникСсылка.Пользователи - Найденная или созданная ссылка  
Функция НайтиИлиСоздатьПользователя(ПользовательИБ) Экспорт
	ПользовательСсылка = НайтиПоНаименованию(ПользовательИБ.Имя);
	Если ПользовательСсылка.Пустая() Тогда
		ПользовательОбъект = СоздатьЭлемент();
		ПользовательОбъект.Наименование = ПользовательИБ.Имя;
		ПользовательОбъект.ПолноеИмя	= ПользовательИБ.ПолноеИмя;
		ПользовательИБ.ЗаполнитьНаборПрав(ПользовательИБ);
		ПользовательОбъект.Записать();
		
		ПользовательСсылка = ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ПользовательСсылка;
КонецФункции